**** C- ' (apostrophe) to edit the block in your mode, then repeat to jump back in

#+BEGIN_SRC emacs-lisp
(directory-files ".")
#+END_SRC

#+RESULTS:
| . | .. | .DS_Store | .git | action.org | meetup.org | node_modules | notes.org | npm-debug.log | package.json | 

**** shell example
#+BEGIN_SRC sh
ls -l
#+END_SRC

#+RESULTS:
| total      | 152 |               |       |       |     |    |       |               |
| -rw-r--r-- |   1 | fugalfunkster | staff |  8482 | Mar | 14 | 22:58 | action.org    |
| -rw-r--r-- |   1 | fugalfunkster | staff |    19 | Mar | 16 | 18:57 | meetup.org    |
| drwxr-xr-x | 287 | fugalfunkster | staff |  9758 | Mar | 16 | 08:42 | node_modules  |
| -rw-r--r-- |   1 | fugalfunkster | staff | 51414 | Mar | 16 | 09:25 | notes.org     |
| -rw-r--r-- |   1 | fugalfunkster | staff |  1463 | Mar | 16 | 09:04 | npm-debug.log |
| -rw-r--r-- |   1 | fugalfunkster | staff |   801 | Mar | 16 | 09:03 | package.json  |

**** Ruby Example
#+BEGIN_SRC ruby
Dir.entries('.')
#+END_SRC

#+RESULTS:
| . | .. | .DS_Store | .git | action.org | meetup.org | node_modules | notes.org | npm-debug.log | package.json |

**** Ruby just outputs the result of the expression, (like a lisp he said)

#+BEGIN_SRC ruby
5* 3
#+END_SRC

#+RESULTS:
: 15

**** Python requires explicit return statements

#+BEGIN_SRC python
return 5 * 3
#+END_SRC

#+RESULTS:
: 15

***** also, output formatting like lists
#+BEGIN_SRC ruby :results list
Dir.entries('.').sort.select do |file|
  file[0] != '.'
end
#+END_SRC

#+RESULTS:
- action.org
- meetup.org
- node_modules
- notes.org
- npm-debug.log
- package.json
- 
**** lets you run code into tables, then pull it out intoto other code blocks
#+NAME: cool-numbers
#+BEGIN_SRC python 
from random import randint
return [[i,    randint(1, 10),
         i ** 2, randint(1, 100),
         i ** 3, randint(1, 1000)] for i in range (1, 11)]
#+END_SRC

#+RESULTS: cool-numbers
|  1 | 9 |   1 | 81 |    1 | 419 |
|  2 | 3 |   4 | 35 |    8 |  50 |
|  3 | 7 |   9 | 77 |   27 | 324 |
|  4 | 5 |  16 | 44 |   64 | 901 |
|  5 | 8 |  25 | 15 |  125 | 991 |
|  6 | 1 |  36 | 59 |  216 | 984 |
|  7 | 5 |  49 | 25 |  343 | 677 |
|  8 | 5 |  64 | 16 |  512 | 392 |
|  9 | 9 |  81 | 41 |  729 | 849 |
| 10 | 6 | 100 | 60 | 1000 | 299 |

#+BEGIN_SRC python :var nums=cool-numbers :results list
return [cell +1 for row in nums for cell in row ]
#+END_SRC

#+RESULTS:
- 2
- 7
- 2
- 13
- 2
- 147
- 3
- 4
- 5
- 75
- 9
- 306
- 4
- 6
- 10
- 16
- 28
- 155
- 5
- 5
- 17
- 18
- 65
- 364
- 6
- 9
- 26
- 33
- 126
- 56
- 7
- 6
- 37
- 45
- 217
- 493
- 8
- 4
- 50
- 64
- 344
- 752
- 9
- 6
- 65
- 48
- 513
- 778
- 10
- 7
- 82
- 35
- 730
- 225
- 11
- 8
- 101
- 19
- 1001
- 269

#+BEGIN_SRC ruby :var fifth=cool-numbers[4]
fifth
#+END_SRC

#+RESULTS:
| 5 | 8 | 25 | 8 | 125 | 761 |

